instance = {
    # 2012 An artificial immune algorithm for multiple-route job shop scheduling problem
    "example": """5 5
2 4 3
0 14 2 18 1 25 4 15
4 22 3 30 0 35
2 3 2
1 15 2 14 3 12
2 22 4 19
3 3 3 4
3 16 0 32 1 21
4 17 1 28 2 24
1 18 2 12 0 25 2 15
3 3 4 4
0 23 3 26 1 32
2 18 4 16 1 15 4 31
3 22 2 16 0 16 2 19
2 3 2
1 31 4 14 3 15
3 28 0 30"""
}

"""5 5 工件数量 工序数量
2 4 3 工件1的加工路径数量 加工路径1的工序数量 加工路径*的工序数量
0 14 2 18 1 25 4 15 工件1的加工路径1
4 22 3 30 0 35 工件1的加工路径*
2 3 2 工件2的加工路径数量 加工路径1的工序数量 加工路径*的工序数量
1 15 2 14 3 12
2 22 4 19
3 3 3 4
3 16 0 32 1 21
4 17 1 28 2 24
1 18 2 12 0 25 2 15
3 3 4 4
0 23 3 26 1 32
2 18 4 16 1 15 4 31
3 22 2 16 0 16 2 19
2 3 2
1 31 4 14 3 15
3 28 0 30"""
